espressif/arduino-esp32/libraries/USB/src/USBAudioCard.cpp
#define _UAC10_CASE_SPEAKER_MONO(_n)                                                           \
  case _n: {                                                                                   \
    uint8_t descriptor[TUD_AUDIO10_SPEAKER_MONO_DESC_LEN(_n)] = {                              \
TUD_AUDIO10_SPEAKER_MONO_DESCRIPTOR(                                                     \
      _itf_num, str_index, ep_num, _max_sample_rate, _spk_channels, _bytes_per_sample,       \
_bits_per_sample, _UAC10_FREQS(_n, _sample_rates)                                      \
    )                                                                                        \
    };                                                                                         \
    *itf += 2;                                                                                 \
    memcpy(dst, descriptor, sizeof(descriptor));                                               \
    return sizeof(descriptor);                                                                 \
  }

#define _UAC10_CASE_MICROPHONE(_n)                                                             \
  case _n: {                                                                                   \
    uint8_t descriptor[TUD_AUDIO10_MICROPHONE_DESC_LEN(_n)] = {                                \
TUD_AUDIO10_MICROPHONE_DESCRIPTOR(                                                       \
      _itf_num, str_index, (uint8_t)(ep_num | 0x80), _max_sample_rate, _mic_channels,        \
_bytes_per_sample, _bits_per_sample, _UAC10_FREQS(_n, _sample_rates)                   \
      )                                                                                        \
    };                                                                                         \
    *itf += 2;                                                                                 \
    memcpy(dst, descriptor, sizeof(descriptor));                                               \
    return sizeof(descriptor);                                                                 \
  }

static uint16_t _uac10_headset_stereo(uint8_t *dst, uint8_t *itf, uint8_t str_index) {
  uint8_t ep_num = tinyusb_get_free_duplex_endpoint();
  TU_VERIFY(ep_num != 0);
  switch (_num_sample_rates) {
    _UAC10_CASES(_UAC10_CASE_HEADSET_STEREO)
    default: return 0;
  }
}

static uint16_t _uac10_headset_mono(uint8_t *dst, uint8_t *itf, uint8_t str_index) {
  uint8_t ep_num = tinyusb_get_free_duplex_endpoint();
  TU_VERIFY(ep_num != 0);
  switch (_num_sample_rates) {
    _UAC10_CASES(_UAC10_CASE_HEADSET_MONO)
    default: return 0;
  }
}

static uint16_t _uac10_speaker_stereo(uint8_t *dst, uint8_t *itf, uint8_t str_index) {
  uint8_t ep_num = tinyusb_get_free_out_endpoint();
  TU_VERIFY(ep_num != 0);
  switch (_num_sample_rates) {
    _UAC10_CASES(_UAC10_CASE_SPEAKER_STEREO)
    default: return 0;
  }
}

static uint16_t _uac10_speaker_mono(uint8_t *dst, uint8_t *itf, uint8_t str_index) {
  uint8_t ep_num = tinyusb_get_free_out_endpoint();
  TU_VERIFY(ep_num != 0);
  switch (_num_sample_rates) {
    _UAC10_CASES(_UAC10_CASE_SPEAKER_MONO)
    default: return 0;
  }
}

static uint16_t _uac10_microphone(uint8_t *dst, uint8_t *itf, uint8_t str_index) {
  uint8_t ep_num = tinyusb_get_free_in_endpoint();
  TU_VERIFY(ep_num != 0);
  switch (_num_sample_rates) {
    _UAC10_CASES(_UAC10_CASE_MICROPHONE)
    default: return 0;
  }
}

#endif  // !TUD_OPT_HIGH_SPEED

uint16_t tusb_audio_load_descriptor(uint8_t *dst, uint8_t *itf) {
  _itf_num = *itf;
#if TUD_OPT_HIGH_SPEED
  uint8_t str_index = tinyusb_add_string_descriptor("TinyUSB UAC2");
  if (_spk_channels == 2 && _mic_channels > 0) {
    // Stereo Headset
    uint8_t ep_num = tinyusb_get_free_duplex_endpoint();
    TU_VERIFY(ep_num != 0);
    uint8_t int_ep_num = tinyusb_get_free_in_endpoint();
    TU_VERIFY(int_ep_num != 0);
    uint8_t descriptor[TUD_AUDIO20_HEADSET_STEREO_DESC_LEN] = {
      // Interface number, string index, EP Out & EP In & EP Interrupt address, max sample rate, speaker channels, mic channels, bytes per sample RX/TX, bits used per sample RX/TX
      TUD_AUDIO20_HEADSET_STEREO_DESCRIPTOR(
        _itf_num, str_index, ep_num, (uint8_t)(ep_num | 0x80), (uint8_t)(int_ep_num | 0x80), CFG_TUD_AUDIO_MAX_SAMPLE_RATE, _spk_channels, _mic_channels,
        _bytes_per_sample, _bits_per_sample
      )
    };
    *itf += 3;
    memcpy(dst, descriptor, TUD_AUDIO20_HEADSET_STEREO_DESC_LEN);
    return TUD_AUDIO20_HEADSET_STEREO_DESC_LEN;
  } else if (_spk_channels == 1 && _mic_channels > 0) {
    // Mono Headset
    uint8_t ep_num = tinyusb_get_free_duplex_endpoint();
    TU_VERIFY(ep_num != 0);
    uint8_t int_ep_num = tinyusb_get_free_in_endpoint();
    TU_VERIFY(int_ep_num != 0);
    uint8_t descriptor[TUD_AUDIO20_HEADSET_MONO_DESC_LEN] = {
      // Interface number, string index, EP Out & EP In & EP Interrupt address, max sample rate, speaker channels, mic channels, bytes per sample RX/TX, bits used per sample RX/TX
      TUD_AUDIO20_HEADSET_MONO_DESCRIPTOR(
        _itf_num, str_index, ep_num, (uint8_t)(ep_num | 0x80), (uint8_t)(int_ep_num | 0x80), CFG_TUD_AUDIO_MAX_SAMPLE_RATE, _spk_channels, _mic_channels,
        _bytes_per_sample, _bits_per_sample
      )
    };
    *itf += 3;
    memcpy(dst, descriptor, TUD_AUDIO20_HEADSET_MONO_DESC_LEN);
    return TUD_AUDIO20_HEADSET_MONO_DESC_LEN;
  } else if (_spk_channels == 2 && _mic_channels == 0) {
    // Stereo Speaker
    uint8_t ep_num = tinyusb_get_free_out_endpoint();
    TU_VERIFY(ep_num != 0);
    uint8_t int_ep_num = tinyusb_get_free_in_endpoint();
    TU_VERIFY(int_ep_num != 0);
    uint8_t descriptor[TUD_AUDIO20_SPEAKER_STEREO_DESC_LEN] = {
      // Interface number, string index, EP Out & EP In & EP Interrupt address, max sample rate, speaker channels, mic channels, bytes per sample RX/TX, bits used per sample RX/TX
      TUD_AUDIO20_SPEAKER_STEREO_DESCRIPTOR(
        _itf_num, str_index, ep_num, (uint8_t)(int_ep_num | 0x80), CFG_TUD_AUDIO_MAX_SAMPLE_RATE, _spk_channels, _bytes_per_sample, _bits_per_sample
      )
    };
    *itf += 2;
    memcpy(dst, descriptor, TUD_AUDIO20_SPEAKER_STEREO_DESC_LEN);
    return TUD_AUDIO20_SPEAKER_STEREO_DESC_LEN;
  } else if (_spk_channels == 1 && _mic_channels == 0) {
    // Mono Speaker
    uint8_t ep_num = tinyusb_get_free_out_endpoint();
    TU_VERIFY(ep_num != 0);
    uint8_t int_ep_num = tinyusb_get_free_in_endpoint();
    TU_VERIFY(int_ep_num != 0);
    uint8_t descriptor[TUD_AUDIO20_SPEAKER_MONO_DESC_LEN] = {
      // Interface number, string index, EP Out & EP In & EP Interrupt address, max sample rate, speaker channels, mic channels, bytes per sample RX/TX, bits used per sample RX/TX
      TUD_AUDIO20_SPEAKER_MONO_DESCRIPTOR(
        _itf_num, str_index, ep_num, (uint8_t)(int_ep_num | 0x80), CFG_TUD_AUDIO_MAX_SAMPLE_RATE, _spk_channels, _bytes_per_sample, _bits_per_sample
      )
    };
    *itf += 2;
    memcpy(dst, descriptor, TUD_AUDIO20_SPEAKER_MONO_DESC_LEN);
    return TUD_AUDIO20_SPEAKER_MONO_DESC_LEN;
  } else if (_spk_channels == 0 && _mic_channels > 0) {
    // Microphone(s)
    uint8_t ep_num = tinyusb_get_free_in_endpoint();
    TU_VERIFY(ep_num != 0);
    uint8_t int_ep_num = tinyusb_get_free_in_endpoint();
    TU_VERIFY(int_ep_num != 0);
    uint8_t descriptor[TUD_AUDIO20_MICROPHONE_DESC_LEN] = {
      // Interface number, string index, EP Out & EP In & EP Interrupt address, max sample rate, speaker channels, mic channels, bytes per sample RX/TX, bits used per sample RX/TX
      TUD_AUDIO20_MICROPHONE_DESCRIPTOR(
        _itf_num, str_index, (uint8_t)(ep_num | 0x80), (uint8_t)(int_ep_num | 0x80), CFG_TUD_AUDIO_MAX_SAMPLE_RATE, _mic_channels, _bytes_per_sample,
        _bits_per_sample
      )
    };
    *itf += 2;
    memcpy(dst, descriptor, TUD_AUDIO20_MICROPHONE_DESC_LEN);
    return TUD_AUDIO20_MICROPHONE_DESC_LEN;
  }
#else
  uint8_t str_index = tinyusb_add_string_descriptor("TinyUSB UAC1");
  if (_spk_channels == 2 && _mic_channels > 0) {
    // Stereo Headset
    return _uac10_headset_stereo(dst, itf, str_index);
  } else if (_spk_channels == 1 && _mic_channels > 0) {
    // Mono Headset
    return _uac10_headset_mono(dst, itf, str_index);
  } else if (_spk_channels == 2 && _mic_channels == 0) {
    // Stereo Speaker
    return _uac10_speaker_stereo(dst, itf, str_index);
  } else if (_spk_channels == 1 && _mic_channels == 0) {
    // Mono Speaker
    return _uac10_speaker_mono(dst, itf, str_index);
  } else if (_spk_channels == 0 && _mic_channels > 0) {
    // Microphone(s)
    return _uac10_microphone(dst, itf, str_index);
  }
#endif
  return 0;
}

TaskHandle_t _uacReceiveTaskHandle = NULL;
void _uacReceiveTask(void *pvParameters) {
  for (;;) {
    uint16_t len = tud_audio_read(_spk_buf, CFG_TUD_AUDIO_FUNC_1_EP_OUT_SW_BUF_SZ);
    if (len > 0 && _cb != NULL) {
      _cb(_spk_buf, len);
    }
    delay(2);
  }
}

#define dump_control_request(p_request)                                                                                                          \
  log_v(                                                                                                                                         \
    "Control request: bRequest = 0x%x, wValue = 0x%x, wIndex = 0x%x, wLength = 0x%x", p_request->bRequest, p_request->wValue, p_request->wIndex, \
    p_request->wLength                                                                                                                           \
  )

// Invoked when audio class specific set request received for an EP
bool tud_audio_set_req_ep_cb(uint8_t rhport, tusb_control_request_t const *p_request, uint8_t *pBuff) {
  (void)rhport;
  dump_control_request(p_request);
#if TUD_OPT_HIGH_SPEED
  (void)pBuff;
  (void)p_request;
  return false;
#else
  uint8_t ctrlSel = TU_U16_HIGH(p_request->wValue);
  if (ctrlSel == AUDIO10_EP_CTRL_SAMPLING_FREQ && p_request->bRequest == AUDIO10_CS_REQ_SET_CUR && p_request->wLength == 3) {
    uint32_t rate = tu_unaligned_read32(pBuff) & 0x00FFFFFF;
    bool supported = false;
    for (uint8_t i = 0; i < _num_sample_rates; i++) {
      if (_sample_rates[i] == rate) {
        supported = true;
        break;
      }
    }
    if (!supported) {
      log_w("Sample rate %" PRIu32 " is not in the advertised list, rejecting", rate);
      return false;
    }
    _sample_rate = rate;
    log_d("EP set current freq: %" PRIu32, _sample_rate);
    // Send SAMPLE RATE Event
    arduino_usb_audio_card_event_data_t p;
    p.sample_rate.rate = _sample_rate;
    arduino_usb_event_post(
      ARDUINO_USB_AUDIO_CARD_EVENTS, ARDUINO_USB_AUDIO_CARD_SAMPLE_RATE_EVENT, &p, sizeof(arduino_usb_audio_card_event_data_t), portMAX_DELAY
    );
    return true;
  }
  log_w("Set EP request not handled, ctrlSel = %d, bRequest = %d, wLength = %d", ctrlSel, p_request->bRequest, p_request->wLength);
  return false;
#endif
}

// Invoked when audio class specific get request received for an EP
bool tud_audio_get_req_ep_cb(uint8_t rhport, tusb_control_request_t const *p_request) {
  dump_control_request(p_request);
#if TUD_OPT_HIGH_SPEED
  (void)rhport;
  (void)p_request;
  return false;
#else
  uint8_t ctrlSel = TU_U16_HIGH(p_request->wValue);
  if (ctrlSel == AUDIO10_EP_CTRL_SAMPLING_FREQ && p_request->bRequest == AUDIO10_CS_REQ_GET_CUR) {
    log_d("EP get current freq");
    uint8_t freq[3];
    freq[0] = (uint8_t)(_sample_rate & 0xFF);
    freq[1] = (uint8_t)((_sample_rate >> 8) & 0xFF);
    freq[2] = (uint8_t)((_sample_rate >> 16) & 0xFF);
    return tud_audio_buffer_and_schedule_control_xfer(rhport, p_request, freq, sizeof(freq));
  }
  log_w("Get EP request not handled, ctrlSel = %d, bRequest = %d, wLength = %d", ctrlSel, p_request->bRequest, p_request->wLength);
  return false;
#endif
}

// Invoked when audio class specific get request received for an entity
bool tud_audio_get_req_entity_cb(uint8_t rhport, tusb_control_request_t const *p_request) {
  uint8_t channelNum = TU_U16_LOW(p_request->wValue);
  uint8_t ctrlSel = TU_U16_HIGH(p_request->wValue);
  uint8_t entityID = TU_U16_HIGH(p_request->wIndex);

  dump_control_request(p_request);

#if TUD_OPT_HIGH_SPEED
  if (entityID == UAC2_ENTITY_CLOCK) {
    if (ctrlSel == AUDIO20_CS_CTRL_SAM_FREQ) {
      if (p_request->bRequest == AUDIO20_CS_REQ_CUR) {
        log_d("Clock get current freq %" PRIu32, _sample_rate);
        audio20_control_cur_4_t curf = {(int32_t)tu_htole32(_sample_rate)};
        return tud_audio_buffer_and_schedule_control_xfer(rhport, p_request, &curf, sizeof(curf));
      } else if (p_request->bRequest == AUDIO20_CS_REQ_RANGE) {
        audio20_control_range_4_n_t(1) rangef = {.wNumSubRanges = tu_htole16(1)};
        rangef.subrange[0].bMin = (int32_t)tu_htole32(_sample_rate);
        rangef.subrange[0].bMax = (int32_t)tu_htole32(_sample_rate);
        rangef.subrange[0].bRes = (int32_t)tu_htole32(0);
        log_d("Clock Range %" PRIu32 ", %" PRIu32 ", %d", _sample_rate, _sample_rate, 0);
        return tud_audio_buffer_and_schedule_control_xfer(rhport, p_request, &rangef, sizeof(rangef));
      }
    } else if (ctrlSel == AUDIO20_CS_CTRL_CLK_VALID && p_request->bRequest == AUDIO20_CS_REQ_CUR) {
      audio20_control_cur_1_t cur_valid = {.bCur = 1};
      log_d("Clock get is valid %u", cur_valid.bCur);
      return tud_audio_buffer_and_schedule_control_xfer(rhport, p_request, &cur_valid, sizeof(cur_valid));
    }
    log_w("Clock get request not supported, entityID = %u, ctrlSel = %u, bRequest = %u", entityID, ctrlSel, p_request->bRequest);
    return false;
  } else if (entityID == UAC2_ENTITY_SPK_FEATURE_UNIT) {
    uint8_t channel = channelNum;
    if (channel != 0 && channel > _spk_channels) {
      log_w("Invalid speaker channel %u for feature unit get request (spk_channels=%u)", channel, _spk_channels);
      return false;
    }
    if (ctrlSel == AUDIO20_FU_CTRL_MUTE && p_request->bRequest == AUDIO20_CS_REQ_CUR) {
      audio20_control_cur_1_t mute1 = {.bCur = _mute[channelNum]};
      log_d("Get channel %u mute %d", channelNum, mute1.bCur);
      return tud_audio_buffer_and_schedule_control_xfer(rhport, p_request, &mute1, sizeof(mute1));
    } else if (ctrlSel == AUDIO20_FU_CTRL_VOLUME) {
      if (p_request->bRequest == AUDIO20_CS_REQ_RANGE) {
        audio20_control_range_2_n_t(1)
          range_vol = {.wNumSubRanges = tu_htole16(1), .subrange = {{.bMin = tu_htole16(-50 * 256), .bMax = tu_htole16(0), .bRes = tu_htole16(256)}}};
        log_d(
          "Get channel %u volume range (%d, %d, %u) dB", channelNum, range_vol.subrange[0].bMin / 256, range_vol.subrange[0].bMax / 256,
          range_vol.subrange[0].bRes / 256
        );
        return tud_audio_buffer_and_schedule_control_xfer(rhport, p_request, &range_vol, sizeof(range_vol));
      } else if (p_request->bRequest == AUDIO20_CS_REQ_CUR) {
        audio20_control_cur_2_t cur_vol = {.bCur = tu_htole16(_volume[channelNum])};
        log_d("Get channel %u volume %d dB", channelNum, cur_vol.bCur / 256);
        return tud_audio_buffer_and_schedule_control_xfer(rhport, p_request, &cur_vol, sizeof(cur_vol));
      }
    }
    log_w("Feature unit get request not supported, entityID = %u, ctrlSel = %u, bRequest = %u", entityID, ctrlSel, p_request->bRequest);
    return false;
  }
  log_w("Get request not handled, entityID = %d, ctrlSel = %d, bRequest = %d", entityID, ctrlSel, p_request->bRequest);
  return false;
#else
  if (entityID == UAC1_ENTITY_SPK_FEATURE_UNIT) {
    if (ctrlSel == AUDIO10_FU_CTRL_MUTE) {
      uint8_t muted = _mute[channelNum];
      log_d("Get Mute of channel: %u", channelNum);
      return tud_audio_buffer_and_schedule_control_xfer(rhport, p_request, &muted, 1);
    } else if (ctrlSel == AUDIO10_FU_CTRL_VOLUME) {
      if (p_request->bRequest == AUDIO10_CS_REQ_GET_CUR) {
        log_d("Get Volume of channel: %u", channelNum);
        return tud_audio_buffer_and_schedule_control_xfer(rhport, p_request, &_volume[channelNum], sizeof(_volume[channelNum]));
      } else if (p_request->bRequest == AUDIO10_CS_REQ_GET_MIN) {
        log_d("Get Volume min of channel: %u", channelNum);
        int16_t vol_min = (int16_t)(-50 * 256);
        return tud_audio_buffer_and_schedule_control_xfer(rhport, p_request, &vol_min, sizeof(vol_min));
      } else if (p_request->bRequest == AUDIO10_CS_REQ_GET_MAX) {
        log_d("Get Volume max of channel: %u", channelNum);
        int16_t vol_max = 0;
        return tud_audio_buffer_and_schedule_control_xfer(rhport, p_request, &vol_max, sizeof(vol_max));
      } else if (p_request->bRequest == AUDIO10_CS_REQ_GET_RES) {
        log_d("Get Volume res of channel: %u", channelNum);
        int16_t vol_res = 256;  // 1 dB in 1/256 dB units
        return tud_audio_buffer_and_schedule_control_xfer(rhport, p_request, &vol_res, sizeof(vol_res));
      } else {
        log_w(
          "Get Volume request not supported, entityID = %d, ctrlSel = %d, bRequest = %d, wLength = %d", entityID, ctrlSel, p_request->bRequest,
          p_request->wLength
        );
        return false;
      }
    }
  }
  log_w("Get request not handled, entityID = %d, ctrlSel = %d, bRequest = %d, wLength = %d", entityID, ctrlSel, p_request->bRequest, p_request->wLength);
  return false;
#endif
}

// Invoked when audio class specific set request received for an entity
bool tud_audio_set_req_entity_cb(uint8_t rhport, tusb_control_request_t const *p_request, uint8_t *buf) {
  (void)rhport;
  uint8_t channelNum = TU_U16_LOW(p_request->wValue);
  uint8_t ctrlSel = TU_U16_HIGH(p_request->wValue);
  uint8_t entityID = TU_U16_HIGH(p_request->wIndex);

  dump_control_request(p_request);

#if TUD_OPT_HIGH_SPEED
  if (entityID == UAC2_ENTITY_SPK_FEATURE_UNIT && p_request->bRequest == AUDIO20_CS_REQ_CUR) {
    if (ctrlSel == AUDIO20_FU_CTRL_MUTE) {
      TU_VERIFY(p_request->wLength == sizeof(audio20_control_cur_1_t));
      _mute[channelNum] = ((audio20_control_cur_1_t const *)buf)->bCur;
      log_d("Set channel %d Mute: %d", channelNum, _mute[channelNum]);
      // Send MUTE Event
      arduino_usb_audio_card_event_data_t p;
      p.mute.channel = (UAC_Channel)channelNum;
      p.mute.muted = _mute[channelNum];
      arduino_usb_event_post(ARDUINO_USB_AUDIO_CARD_EVENTS, ARDUINO_USB_AUDIO_CARD_MUTE_EVENT, &p, sizeof(arduino_usb_audio_card_event_data_t), portMAX_DELAY);
      return true;
    } else if (ctrlSel == AUDIO20_FU_CTRL_VOLUME) {
      TU_VERIFY(p_request->wLength == sizeof(audio20_control_cur_2_t));
      _volume[channelNum] = ((audio20_control_cur_2_t const *)buf)->bCur;
      log_d("Set channel %d volume: %d dB", channelNum, _volume[channelNum] / 256);
      // Send Volume Event
      arduino_usb_audio_card_event_data_t p;
      p.volume.channel = (UAC_Channel)channelNum;
      p.volume.db = _volume[channelNum] / 256;
      arduino_usb_event_post(
        ARDUINO_USB_AUDIO_CARD_EVENTS, ARDUINO_USB_AUDIO_CARD_VOLUME_EVENT, &p, sizeof(arduino_usb_audio_card_event_data_t), portMAX_DELAY
      );
      return true;
    }
    log_w("Feature unit set request not supported, entityID = %u, ctrlSel = %u, bRequest = %u", entityID, ctrlSel, p_request->bRequest);
    return false;
  } else if (entityID == UAC2_ENTITY_CLOCK && p_request->bRequest == AUDIO20_CS_REQ_CUR) {
    if (ctrlSel == AUDIO20_CS_CTRL_SAM_FREQ) {
      TU_VERIFY(p_request->wLength == sizeof(audio20_control_cur_4_t));
      _sample_rate = (uint32_t)((audio20_control_cur_4_t const *)buf)->bCur;
      log_d("Clock set current freq: %" PRIu32, _sample_rate);
      // Send SAMPLE RATE Event
      arduino_usb_audio_card_event_data_t p;
      p.sample_rate.rate = _sample_rate;
      arduino_usb_event_post(
        ARDUINO_USB_AUDIO_CARD_EVENTS, ARDUINO_USB_AUDIO_CARD_SAMPLE_RATE_EVENT, &p, sizeof(arduino_usb_audio_card_event_data_t), portMAX_DELAY
      );
      return true;
    }
    log_w("Clock set request not supported, entityID = %u, ctrlSel = %u, bRequest = %u", entityID, ctrlSel, p_request->bRequest);
    return false;
  }
  log_w("Set request not handled, entityID = %d, ctrlSel = %d, bRequest = %d", entityID, ctrlSel, p_request->bRequest);
  return false;
#else
  if (entityID == UAC1_ENTITY_SPK_FEATURE_UNIT && p_request->bRequest == AUDIO10_CS_REQ_SET_CUR) {
    if (ctrlSel == AUDIO10_FU_CTRL_MUTE && p_request->wLength == 1) {
      _mute[channelNum] = buf[0];
      log_d("Set Mute: %d of channel: %u", _mute[channelNum], channelNum);
      // Send MUTE Event
      arduino_usb_audio_card_event_data_t p;
      p.mute.channel = (UAC_Channel)channelNum;
      p.mute.muted = _mute[channelNum];
      arduino_usb_event_post(ARDUINO_USB_AUDIO_CARD_EVENTS, ARDUINO_USB_AUDIO_CARD_MUTE_EVENT, &p, sizeof(arduino_usb_audio_card_event_data_t), portMAX_DELAY);
      return true;
    } else if (ctrlSel == AUDIO10_FU_CTRL_VOLUME && p_request->wLength == 2) {
      _volume[channelNum] = (int16_t)tu_unaligned_read16(buf);
      log_d("Set Volume: %d dB of channel: %u", _volume[channelNum] / 256, channelNum);
      // Send Volume Event
      arduino_usb_audio_card_event_data_t p;
      p.volume.channel = (UAC_Channel)channelNum;
      p.volume.db = _volume[channelNum] / 256;
      arduino_usb_event_post(
        ARDUINO_USB_AUDIO_CARD_EVENTS, ARDUINO_USB_AUDIO_CARD_VOLUME_EVENT, &p, sizeof(arduino_usb_audio_card_event_data_t), portMAX_DELAY
      );
      return true;
    }
  }
  log_w("Set request not handled, entityID = %d, ctrlSel = %d, bRequest = %d, wLength = %d", entityID, ctrlSel, p_request->bRequest, p_request->wLength);
  return false;
#endif
}

bool tud_audio_set_itf_close_ep_cb(uint8_t rhport, tusb_control_request_t const *p_request) {
  (void)rhport;
  dump_control_request(p_request);
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_DEBUG
  uint8_t const itf = tu_u16_low(tu_le16toh(p_request->wIndex)) - _itf_num;
  uint8_t const alt = tu_u16_low(tu_le16toh(p_request->wValue));
  log_d("Close EP interface %d alt %d", itf, alt);
#endif
  return true;
}

bool tud_audio_set_itf_cb(uint8_t rhport, tusb_control_request_t const *p_request) {
  (void)rhport;
  dump_control_request(p_request);
  uint8_t const itf = tu_u16_low(tu_le16toh(p_request->wIndex)) - _itf_num;
  uint8_t const alt = tu_u16_low(tu_le16toh(p_request->wValue));
  log_d("Set interface %d alt %d", itf, alt);
  // Send Interface Event
  arduino_usb_audio_card_event_data_t p;
  if (_spk_channels > 0 && itf == 1) {
    p.interface_enable.interface = UAC_INTERFACE_SPK;
  } else if (_spk_channels == 0 && itf == 1) {
    p.interface_enable.interface = UAC_INTERFACE_MIC;
  } else {
    p.interface_enable.interface = UAC_INTERFACE_MIC;
  }
  p.interface_enable.enable = alt != 0;
  arduino_usb_event_post(
    ARDUINO_USB_AUDIO_CARD_EVENTS, ARDUINO_USB_AUDIO_CARD_INTERFACE_ENABLE_EVENT, &p, sizeof(arduino_usb_audio_card_event_data_t), portMAX_DELAY
  );
  return true;
}

USBAudioCard::USBAudioCard(const uint32_t *sample_rates, uint8_t num_rates, UAC_Bits_Per_Sample bps, UAC_SPK_Channels spk_channels, UAC_MIC_Channels mic_channels) {
  if (_uac == NULL) {
    if ((uint8_t)spk_channels > 2) {
      log_e("Maximum of 2 speaker channels supported!");
      return;
    }
    if (num_rates == 0 || num_rates > USBAudioCard::UAC_MAX_SAMPLE_RATES) {
      log_e("Invalid number of sample rates %u (1..%u) supported!", num_rates, USBAudioCard::UAC_MAX_SAMPLE_RATES);
      return;
    }
    if (sample_rates == NULL) {
      log_e("sample_rates pointer is NULL!");
      return;
    }
    _uac = this;
    _num_sample_rates = num_rates;
    _max_sample_rate = 0;
    for (uint8_t i = 0; i < num_rates; i++) {
      _sample_rates[i] = sample_rates[i];
      if (_sample_rates[i] > _max_sample_rate) {
        _max_sample_rate = _sample_rates[i];
      }
    }
    _sample_rate = _sample_rates[0];
    _bits_per_sample = (uint8_t)bps;
    _bytes_per_sample = (_bits_per_sample <= 16) ? 2 : 4;
    _spk_channels = (uint8_t)spk_channels;
    _mic_channels = (uint8_t)mic_channels;

